In [1]:
%autosave 0

Autosave disabled

In [2]:
import numpy as np
import pandas as pd
from sqlalchemy import text, create_engine

from env import get_connection

# Exercises I

## Run python -m pip install pymysql from your terminal to install pymysql. ✔️

### Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

#### - 1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

✔️

#### - 2. cd into your exercises folder for this module and run echo env.py >> .gitignore

✔️

#### - 3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

- the code below would go into a pythn script file to assign the credential data in order to connect to a database to retrieve data you need.
- this would be hidden in a .gitignore folder in order to not display those credentials to the world.

In [3]:
"""
def get_db_url(db, user=username , host=hostname, password=password):
    return f'mysql+pymysql://{user}:{password}@{host}/employees'
"""

"\ndef get_db_url(db, user=username , host=hostname, password=password):\n    return f'mysql+pymysql://{user}:{password}@{host}/employees'\n"

#### INSTRUCTOR EX:

In [4]:
def get_db_url(database):
    return get_connection(database)
    #return f'mysql+pymysql://{user}:{password}@{host}/{database}'

#### - 4. Use your function to obtain a connection to the employees database.

- a function was not used, as it was set-up in the lesson

In [5]:
# Get the database connection URL for the 'employees' database
url = get_connection('employees')

# Create a database engine using SQLAlchemy
engine = create_engine(url)

# Define a SQL query to select all columns from the 'employees' table
query = '''
        SELECT *
        FROM employees
        '''
#can also do query = tex('123abc')


# Create a SQLAlchemy text object for the SQL query
text_query = text(query)

In [6]:
# Use pandas read_sql() to execute the query on the database using the engine,
# and store the result in a DataFrame called 'df'
df = pd.read_sql(text_query, engine.connect())

# Display the first few rows of the DataFrame
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

#### INSTRUCTOR EX:

In [7]:
# SQL database and query
url = get_db_url('employees')
query = text('SELECT * FROM employees')

In [8]:
# Acquire dataframe from database
engine = create_engine(url)
df = pd.read_sql(query, engine.connect())

### - 5. Once you have successfully run a query:

####    -    a. Intentionally make a typo in the database url. What kind of error message do you see?

    ### OperationalError: (pymysql.err.OperationalError) (2003, "Can't connect to MySQL server on 'data.codeupd.com' ([Errno 8] nodename nor servname provided, or not known)")
### (Background on this error at: https://sqlalche.me/e/14/e3q8)

                        - The error message reads cannot connect to the MySQL server due to a background error at the URL
                        - 1040 unknown database (instructor error code)

####    -    b. Intentionally make an error in your SQL query. What does the error message look like?

    ### ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.employeasdes' doesn't exist")
    ### [SQL: 
    ###         SELECT *
    ###         FROM employeasdes
    ###         ]
### (Background on this error at: https://sqlalche.me/e/14/f405)

                         - The error message reads table does not exist at this url
                         - 1064 you have an error MySQL syntax (instructor error code)

#### - 6. Read the employees and titles tables into two separate DataFrames.

In [9]:
employee_query = '''
SELECT *
FROM employees
'''

title_query = '''
SELECT *
FROM titles
'''

employee_query = pd.read_sql(text(employee_query), engine.connect())
title_query = pd.read_sql(text(title_query), engine.connect())

In [10]:
employee_query.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [11]:
title_query.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

#### - 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [12]:
title_query.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [13]:
employee_query.shape

(300024, 6)

In [14]:
title_query.shape

(443308, 4)

- I did not expect the number shown, but kinf of because we touched SQL beforehand.

#### - 8. Display the summary statistics for each DataFrame.

In [15]:
employee_query.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [16]:
title_query.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

#### - 9. How many unique titles are in the titles DataFrame?

In [17]:
title_query['title'].nunique()

7

#### - 10. What is the oldest date in the to_date column?

In [18]:
title_query['to_date'].min()

datetime.date(1985, 3, 1)

#### -11. What is the most recent date in the to_date column?

In [19]:
title_query['to_date'].max()

datetime.date(9999, 1, 1)

---------------------------------------------------------------------------------------------------------------------------------------------------

# Exercises II

## Copy the users and roles DataFrames from the examples in the lesson.

In [20]:
# Create the users DataFrame.
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [21]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

1. What is the result of using a right join on the DataFrames?

In [22]:
users.merge(roles, how='right', left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

- it resulted in Nan values  when users.name_x column was right joined

In [23]:
roles.merge(users, how='right', left_on='id', right_on='id')

   id     name_x name_y  role_id
0   1      admin    bob      1.0
1   2     author    joe      2.0
2   3   reviewer  sally      3.0
3   4  commenter   adam      3.0
4   5        NaN   jane      NaN
5   6        NaN   mike      NaN

- a right join on users resuted in Nan values in name_x and role id columns and commenter was places as a name which is not correct.

2. What is the result of using an outer join on the DataFrames?

In [24]:
users.merge(roles, how='outer', left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

- when outer joined using the merge function on the dataframes, i got the same values as an earlier right join from roles to users.

In [25]:
roles.merge(users, how='right', left_on='id', right_on='id')

   id     name_x name_y  role_id
0   1      admin    bob      1.0
1   2     author    joe      2.0
2   3   reviewer  sally      3.0
3   4  commenter   adam      3.0
4   5        NaN   jane      NaN
5   6        NaN   mike      NaN

- in this merge I flipped the data frames position within the function and received almost the same outcome with different values assigned with similar columns

3. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [26]:
users.merge(roles, how='outer')

   id       name  role_id
0   1        bob      1.0
1   2        joe      2.0
2   3      sally      3.0
3   4       adam      3.0
4   5       jane      NaN
5   6       mike      NaN
6   1      admin      NaN
7   2     author      NaN
8   3   reviewer      NaN
9   4  commenter      NaN

In [27]:
# users.merge(roles, how='right', left_on='role_id', right_on='id')

- you can't merge df without a foreign key as error message displayed above

#### INSTRUCTOR EX:

In [28]:
pd.merge(users, roles, how='outer', indicator=True)

   id       name  role_id      _merge
0   1        bob      1.0   left_only
1   2        joe      2.0   left_only
2   3      sally      3.0   left_only
3   4       adam      3.0   left_only
4   5       jane      NaN   left_only
5   6       mike      NaN   left_only
6   1      admin      NaN  right_only
7   2     author      NaN  right_only
8   3   reviewer      NaN  right_only
9   4  commenter      NaN  right_only

4. Load the mpg dataset from PyDataset.

In [29]:
from pydataset import data

In [30]:
mpg_df = data('mpg')

5. Output and read the documentation for the mpg dataset.

In [31]:
data('mpg', show_doc=True) # view the documentation for the dataset

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

6. How many rows and columns are in the dataset?

In [32]:
mpg_df.shape

(234, 11)

7. Check out your column names and perform any cleanup you may want on them.

In [33]:
mpg_df = mpg_df.rename(columns={'displ': 'display', 'cyl': 'cylinder', 'cty': 'city', 'hwy': 'highway', 'drv': 'drive'})

In [34]:
mpg_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   display       234 non-null    float64
 3   year          234 non-null    int64
 4   cylinder      234 non-null    int64
 5   trans         234 non-null    object
 6   drive         234 non-null    object
 7   city          234 non-null    int64
 8   highway       234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

8. Display the summary statistics for the dataset.

In [35]:
mpg_df.describe()

          display         year    cylinder        city     highway
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

9. How many different manufacturers are there?

In [36]:
mpg_df['manufacturer'].nunique()

15

10. How many different models are there?

In [37]:
mpg_df['model'].nunique()

38

11. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [38]:
mpg_df['mileage_difference'] = mpg_df['highway'] - mpg_df['city']
mpg_df.head()

,manufacturer,model,display,year,cylinder,trans,drive,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

12. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [39]:
mpg_df['average_mileage'] = (mpg_df['city'] + mpg_df['highway'])/2
mpg_df.head()

,manufacturer,model,display,year,cylinder,trans,drive,city,highway,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

13. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [40]:
mpg_df['trans'].value_counts()

auto(l4)      83
manual(m5)    58
auto(l5)      39
manual(m6)    19
auto(s6)      16
auto(l6)       6
auto(av)       5
auto(s5)       3
auto(s4)       3
auto(l3)       2
Name: trans, dtype: int64

In [41]:
mpg_df['is_automatic'] = mpg_df['trans'].str.startswith('a')
mpg_df['is_automatic']

1       True
2      False
3      False
4       True
5       True
       ...
230     True
231    False
232     True
233    False
234     True
Name: is_automatic, Length: 234, dtype: bool

#### INSTRUCTOR EX:

In [42]:
mpg_df['is_automatic'] = mpg_df.trans.str.contains('auto')

mpg_df.head()

,manufacturer,model,display,year,cylinder,trans,drive,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

14. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [43]:
mpg_df.groupby('manufacturer')['average_mileage'].mean().sort_values().tail(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

15. Do automatic or manual cars have better miles per gallon?

In [44]:
mpg_df.groupby('is_automatic')['average_mileage'].mean().sort_values()

is_automatic
True     19.130573
False    22.227273
Name: average_mileage, dtype: float64

# Exercises III

1. Use your get_db_url function to help you explore the data from the chipotle database.

In [45]:
# Get the database connection URL for the 'chipotle' database
url = get_connection('chipotle')

# Create a database engine using SQLAlchemy
engine = create_engine(url)

# Define a SQL query to select all columns from the 'chipotle' table
query = '''
        SELECT *
        FROM orders
        '''

# Create a SQLAlchemy text object for the SQL query
text_query = text(query)

In [46]:
# Use pandas read_sql() to execute the query on the database using the engine,
# and store the result in a DataFrame called 'orders_df'
orders_df = pd.read_sql(text_query, engine.connect())

# Display the first few rows of the DataFrame
orders_df.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [47]:
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   object
dtypes: int64(3), object(3)
memory usage: 216.8+ KB

2. What is the total price for each order?

In [63]:
orders_df['item_price'] = orders_df['item_price'].str.replace('$', '') * orders_df['quantity']
orders_df.head()

# orders_df.sort_values.group('order_id')['item_price']

/var/folders/hz/r10rvhgs41x5bxdmg79hksdw0000gn/T/ipykernel_58427/2887746726.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders_df['item_price'] = orders_df['item_price'].str.replace('$', '') * orders_df['quantity']

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98 16.98 16.98 16.98

## INSTRCUTIOR EX:

In [49]:
#instructor ex:

orders_df['item_price'] = orders_df['quantity'] * orders_df['item_price']
orders_df.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98 $16.98

3. What are the most popular 3 items?

In [50]:
orders_df['item_name'].value_counts().head(3)

Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Name: item_name, dtype: int64

4. Which item has produced the most revenue?

In [51]:
most_rev = orders_df.groupby('item_name').item_price.sum().sort_values(ascending = False).head(1)
most_rev

item_name
Carnitas Soft Tacos    $9.25 $9.25 $9.25 $9.25 $9.25 $8.99 $8.99 $8.99 $9.25 $9.25 $9.25 $9.25 $9.25 $9.25 $9...
Name: item_price, dtype: object

5. Join the employees and titles DataFrames together.

In [65]:
url = get_db_url('employees')
engine = create_engine(url)

In [66]:
titles_query = text('''SELECT * 
                       FROM titles'''
                   )

#acquire data from sql
titles_df = pd.read_sql(titles_query, engine.connect())

In [70]:
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [71]:
employees_query = text('''
                          SELECT * 
                          FROM employees'''
                          )

employees_df = pd.read_sql(employees_query, engine.connect())

In [72]:
employees_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [75]:
empl_ttl_df = employees_df.merge(titles_df, left_on='emp_no', right_on='emp_no')

In [76]:
empl_ttl_df

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

In [78]:
empl_ttl_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 443308 entries, 0 to 443307
Data columns (total 9 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      443308 non-null  int64
 1   birth_date  443308 non-null  object
 2   first_name  443308 non-null  object
 3   last_name   443308 non-null  object
 4   gender      443308 non-null  object
 5   hire_date   443308 non-null  object
 6   title       443308 non-null  object
 7   from_date   443308 non-null  object
 8   to_date     443308 non-null  object
dtypes: int64(1), object(8)
memory usage: 33.8+ MB

6. For each title, find the hire date of the employee that was hired most recently with that title.

In [81]:
empl_ttl_df.groupby('title').hire_date.max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [83]:
# query to join three tables for corsstabulation problem
dept_title_query = text('''
                        SELECT t.emp_no, t.title, t.from_date,t.to_date, d.dept_name 
                        FROM departments AS d 
                        JOIN dept_emp AS de USING(dept_no) 
                        JOIN titles AS t USING(emp_no);''')

In [84]:
# read in the dept titles db to use for cros tabulations
dept_titles = pd.read_sql(dept_title_query, engine.connect())
# checked for a df to generate
dept_titles

        emp_no         title   from_date     to_date         dept_name
0        10011         Staff  1990-01-22  1996-11-09  Customer Service
1        10038  Senior Staff  1996-09-20  9999-01-01  Customer Service
2        10038         Staff  1989-09-20  1996-09-20  Customer Service
3        10049  Senior Staff  2000-05-04  9999-01-01  Customer Service
4        10049         Staff  1992-05-04  2000-05-04  Customer Service
...        ...           ...         ...         ...               ...
489898  499986  Senior Staff  1992-08-11  9999-01-01             Sales
489899  499986         Staff  1985-08-11  1992-08-11             Sales
489900  499987         Staff  1999-12-21  9999-01-01             Sales
489901  499988  Senior Staff  1997-07-25  2001-10-09             Sales
489902  499988         Staff  1988-07-25  1997-07-25             Sales

[489903 rows x 5 columns]

In [85]:
# assigned a new variable name and used the crosstab method on to the two df and specific columns.
all_titles_crosstab = pd.crosstab(
    dept_titles.dept_name, dept_titles.title)

In [86]:
# checked to see if cross tabulation took effect
all_titles_crosstab

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0

In [87]:
# used a boolean mask to find current titles within the dept titles df. and then returned first 5 items from new assigned df 'current_titles'
current_titles = dept_titles[dept_titles.to_date == dept_titles.to_date.max()]
current_titles.head()

    emp_no         title   from_date     to_date         dept_name
1    10038  Senior Staff  1996-09-20  9999-01-01  Customer Service
3    10049  Senior Staff  2000-05-04  9999-01-01  Customer Service
5    10060  Senior Staff  1996-05-28  9999-01-01  Customer Service
7    10088  Senior Staff  1993-09-02  9999-01-01  Customer Service
11   10112         Staff  1998-05-01  9999-01-01  Customer Service

In [88]:
current_titles_crosstab = pd.crosstab(current_titles.dept_name, current_titles.title)
current_titles_crosstab
#switch column/row values 
# current_titles_crosstab.T

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,68,627,1,1790,12349,3902,241
Development,1833,15677,1,43364,1085,315,6117
Finance,0,0,1,0,10650,3199,0
Human Resources,0,0,1,0,10843,3416,0
Marketing,0,0,1,0,12371,3880,0
Production,1542,13325,1,37156,1123,349,5210
Quality Management,433,3744,1,10390,0,0,1422
Research,77,830,1,2250,10219,3206,321
Sales,0,0,1,0,32032,9967,0